<template>
    <multiselect label="title"
                 trackBy="key" :options="options" v-model="value" />
    <!--    <CriterionSelect :options="options" />-->
</template>

<script>
import RegisterConfirmForm from "@/components/auth/RegisterConfirmForm.vue";
import RegisterForm from "@/components/auth/RegisterForm.vue";
// import CriterionSelect from "@/components/common/CriterionSelect.vue";

export default {
    name: "components_testing",
    // components: { CriterionSelect, RegisterForm, RegisterConfirmForm },
    data() {
        return {
            value: null,
            todos: [
                { text: "Заявление №1" },
                { text: "Заявление №2" },
                { text: "Заявление №3" }
            ],
            options: [
                {
                    id: 1,
                    title: "Учебный A",
                    description:
                        "получение в течение не менее 2 (двух) следующих друг за другом промежуточных аттестаций, предшествующих назначению ПГАС, только оценок «отлично»",
                    key: "educational_a"
                },
                {
                    id: 2,
                    title: "Учебный B",
                    description:
                        "получение студентом в течении года, предшествующего назначению ПАГС.награды(приза) за результаты проектной деятельности и (или) опытно-конструкторской работы",
                    key: "educational_b"
                },
                {
                    id: 3,
                    title: "Учебный C",
                    description:
                        "признание студента победителем или призером международной, всероссийский, ведомственной или региональной олимпиады, конкурса, соревнования, состязания или иного мероприятия, направленных на выявление учебных достижений студентов, проведенных в течении года, предшествующего назначению ПГАС",
                    key: "educational_c"
                },
                {
                    id: 4,
                    title: "Научно-исследовательский A",
                    description:
                        "получение студентом в течение года, предшествующего назначению ПГАС, награды (приза) за результаты научно-исследовательской работы, проводимой студентом",
                    key: "scientific_a"
                },
                {
                    id: 5,
                    title: "Научно-исследовательский B",
                    description:
                        "Получение студентом в течении года, преществующего назначению ПАГС. документа, удостоверяющего исключительное право студента на достигнутый им научный (научно-методический, научно=технический, научно-творческий) результат интеллектуальной деятельности (патент, свидетельство)",
                    key: "scientific_b"
                },
                {
                    id: 6,
                    title: "Научно-исследовательский C",
                    description:
                        "Получение студентом в течении года, предшествующего назначению ПГАС, гранта на выполнение научно-исследовательской работы",
                    key: "scientific_c"
                },
                {
                    id: 7,
                    title: "Научно-исследовательский D",
                    description:
                        "Наличие у студента публикации в научном (учебно-научном, учебно-методическом) международном, всероссийском, ведомственном или региональном издании, в издании Университета или иной организации в течение года, предшествующего назначению ПГАС",
                    key: "scientific_d"
                },
                {
                    id: 8,
                    title: "Общественный A",
                    description:
                        "Систематическое участие студента в течение года, предшествующего назначению ПгАС в проведении (обеспечении проведения) общественно значимой деятельнсоти социального, культурного, правозащитного, общественно полезного характера, организуемой Университетом или с его участием, подтверждаемое документально",
                    key: "social_a"
                },
                {
                    id: 9,
                    title: "Общественный B",
                    description:
                        "Систематическое участие студента в течение года, предшествующего назначению ПГАС, в деятельности по информационному обеспечению общественно значимых мероприятий, общественной жизни Университета, подтверждаемое документально",
                    key: "social_b"
                },
                {
                    id: 10,
                    title: "Культурно-творческий A",
                    description:
                        "Получение студентом в течение года, предшествующего назначению ПГАС, награды (приза) за результаты культурно-творческой деятельности, осуществленной им в рамках деятельности, проводимой Университетом или иной организацией, в том числе в рамках конкурса, смотра и иного аналогичного международного, всероссийского, ведомственного, регионального мероприятия подтверждаемое документально.",
                    key: "cultural_a"
                },
                {
                    id: 11,
                    title: "Культурно-творческий B",
                    description:
                        "Публичное представление студентом в течение года, предшествующего назначению ПГАС, созданного им произведения литературы или искусства (литературного произведения, драматического, музыкально-драматического произведения, сценарного произведения, хореографического произведения, пантомимы, музыкального произведения с текстом или без текста, аудиовизуального произведения, произведения живописи, скульптуры, графики, дизайна, графического рассказа, комикса, другого произведения изобразительного искусства, произведения декоративно-прикладного, сценографического искусства, произведения архитектуры, градостроительства, садово-паркового искусства, в то числе в виде проекта, чертежа, изображения, макета, фотографического произведения, произведения, полученного способом, аналогичным фотографии, географической, геологической, другой карты, плана, эскиза, пластического произведения, относящегося к географии, топографии и другим наукам, а также другого произведения), и получившее положительную оценку международного, всероссийского, ведомственного, регионального мероприятия, подтверждаемое документально.",
                    key: "cultural_b"
                },
                {
                    id: 12,
                    title: "Культурно-творческий C",
                    description:
                        "Систематическое участие студента в течение года, предшествующего назначению ПГАС, в проведении (обеспечении проведения) публичной культурно-творческой деятельности воспитательного, пропагандистского характера и иной общественно значимой публичной культурно-творческой деятельности, подтверждаемое документально",
                    key: "cultural_c"
                },
                {
                    id: 13,
                    title: "Спортивный A",
                    description:
                        "Получение студентом в течение года, предшествующего назначению ПГАС, награды (приза) за результаты спортивной деятельности, осуществленной им в рамках спортивных международных, всероссийских, ведомственных, региональных мероприятий, проводимых Университетом или иной организацией.",
                    key: "sport_a"
                },
                {
                    id: 14,
                    title: "Спортивный B",
                    description:
                        "Систематическое участие студента в течение года, предшествующего назначению ПГС, в спортивных мероприятиях воспитательного, пропагандистского характера и (или) иных общественно значимых спортивных мероприятиях, подтверждаемое документально.",
                    key: "sport_b"
                },
                {
                    id: 15,
                    title: "Спортивный C",
                    description:
                        "Выполнение нормативов и требований золотого знака отличия Всероссийского физкультурно-спортивного комплекса «Готов к труду и обороны» (ГТО) соответствующей возрастной группы на дату назначения ПГАС",
                    key: "sport_c"
                }
            ]
        };
    },
    methods: {
        something() {
            this.$modal.show(RegisterConfirmForm);
        }
    },
    mounted() {
        // this.something();
    }
};
</script>

<style scoped lang="scss"></style>
